In [79]:
import pandas as pd
import numpy as np
import seaborn as sns
from datetime import datetime
%matplotlib inline

In [80]:
df = pd.read_csv('https://raw.githubusercontent.com/robotautas/ML_scikit_learn_advertising/master/advertising.csv')

In [81]:
df.head()

,Daily Time Spent on Site,Age,Area Income,Daily Internet Usage,Ad Topic Line,City,Male,Country,Timestamp,Clicked on Ad
0,68.95,35,61833.90,256.09,Cloned 5thgeneration orchestration,Wrightburgh,0,Tunisia,2016-03-27 00:53:11,0
1,80.23,31,68441.85,193.77,Monitored national standardization,West Jodi,1,Nauru,2016-04-04 01:39:02,0
2,69.47,26,59785.94,236.50,Organic bottom-line service-desk,Davidton,0,San Marino,2016-03-13 20:35:42,0
3,74.15,29,54806.18,245.89,Triple-buffered reciprocal time-frame,West Terrifurt,1,Italy,2016-01-10 02:31:19,0
4,68.37,35,73889.99,225.58,Robust logistical utilization,South Manuel,0,Iceland,2016-06-03 03:36:18,0

In [82]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 10 columns):
 #   Column                    Non-Null Count  Dtype
---  ------                    --------------  -----
 0   Daily Time Spent on Site  1000 non-null   float64
 1   Age                       1000 non-null   int64
 2   Area Income               1000 non-null   float64
 3   Daily Internet Usage      1000 non-null   float64
 4   Ad Topic Line             1000 non-null   object
 5   City                      1000 non-null   object
 6   Male                      1000 non-null   int64
 7   Country                   1000 non-null   object
 8   Timestamp                 1000 non-null   object
 9   Clicked on Ad             1000 non-null   int64
dtypes: float64(3), int64(3), object(4)
memory usage: 78.2+ KB

In [83]:
def time_of_day(x):
    hour = datetime.fromisoformat(x).hour
    if hour >= 6 and hour <12:
        return 'rytas'
    elif hour >= 12 and hour < 18:
        return 'diena'
    elif hour >= 18 and hour <= 23:
        return 'vakaras'
    return 'naktis'

In [84]:
datetime.fromisoformat('2016-04-25 11:01:54').hour

11

In [85]:
df['paros_metas'] = df['Timestamp'].apply(time_of_day)

In [86]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 11 columns):
 #   Column                    Non-Null Count  Dtype
---  ------                    --------------  -----
 0   Daily Time Spent on Site  1000 non-null   float64
 1   Age                       1000 non-null   int64
 2   Area Income               1000 non-null   float64
 3   Daily Internet Usage      1000 non-null   float64
 4   Ad Topic Line             1000 non-null   object
 5   City                      1000 non-null   object
 6   Male                      1000 non-null   int64
 7   Country                   1000 non-null   object
 8   Timestamp                 1000 non-null   object
 9   Clicked on Ad             1000 non-null   int64
 10  paros_metas               1000 non-null   object
dtypes: float64(3), int64(3), object(5)
memory usage: 86.1+ KB

In [87]:
df['City'].value_counts()

Williamsport         3
Lisamouth            3
Port Jason           2
Lake Jose            2
West Amanda          2
                    ..
New Timothy          1
Lake Jessicaville    1
Garciaview           1
North Alexandra      1
Edwardsmouth         1
Name: City, Length: 969, dtype: int64

In [88]:
df.drop(['Ad Topic Line', 'City', 'Country'], 1, inplace=True)

In [89]:
df.head()

,Daily Time Spent on Site,Age,Area Income,Daily Internet Usage,Male,Timestamp,Clicked on Ad,paros_metas
0,68.95,35,61833.90,256.09,0,2016-03-27 00:53:11,0,naktis
1,80.23,31,68441.85,193.77,1,2016-04-04 01:39:02,0,naktis
2,69.47,26,59785.94,236.50,0,2016-03-13 20:35:42,0,vakaras
3,74.15,29,54806.18,245.89,1,2016-01-10 02:31:19,0,naktis
4,68.37,35,73889.99,225.58,0,2016-06-03 03:36:18,0,naktis

In [90]:
df = pd.get_dummies(df, columns=['paros_metas'])

In [91]:
df.head()

,Daily Time Spent on Site,Age,Area Income,Daily Internet Usage,Male,Timestamp,Clicked on Ad,paros_metas_diena,paros_metas_naktis,paros_metas_rytas,paros_metas_vakaras
0,68.95,35,61833.90,256.09,0,2016-03-27 00:53:11,0,0,1,0,0
1,80.23,31,68441.85,193.77,1,2016-04-04 01:39:02,0,0,1,0,0
2,69.47,26,59785.94,236.50,0,2016-03-13 20:35:42,0,0,0,0,1
3,74.15,29,54806.18,245.89,1,2016-01-10 02:31:19,0,0,1,0,0
4,68.37,35,73889.99,225.58,0,2016-06-03 03:36:18,0,0,1,0,0

In [92]:
df.drop(['Timestamp'], 1, inplace=True)

In [93]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 10 columns):
 #   Column                    Non-Null Count  Dtype
---  ------                    --------------  -----
 0   Daily Time Spent on Site  1000 non-null   float64
 1   Age                       1000 non-null   int64
 2   Area Income               1000 non-null   float64
 3   Daily Internet Usage      1000 non-null   float64
 4   Male                      1000 non-null   int64
 5   Clicked on Ad             1000 non-null   int64
 6   paros_metas_diena         1000 non-null   uint8
 7   paros_metas_naktis        1000 non-null   uint8
 8   paros_metas_rytas         1000 non-null   uint8
 9   paros_metas_vakaras       1000 non-null   uint8
dtypes: float64(3), int64(3), uint8(4)
memory usage: 50.9 KB

In [94]:
df.head()

,Daily Time Spent on Site,Age,Area Income,Daily Internet Usage,Male,Clicked on Ad,paros_metas_diena,paros_metas_naktis,paros_metas_rytas,paros_metas_vakaras
0,68.95,35,61833.90,256.09,0,0,0,1,0,0
1,80.23,31,68441.85,193.77,1,0,0,1,0,0
2,69.47,26,59785.94,236.50,0,0,0,0,0,1
3,74.15,29,54806.18,245.89,1,0,0,1,0,0
4,68.37,35,73889.99,225.58,0,0,0,1,0,0

In [95]:
X = df.drop('Clicked on Ad', 1)

In [96]:
y = df['Clicked on Ad']

In [97]:
from sklearn.model_selection import train_test_split

In [98]:
X_train, X_test, y_train, y_test = train_test_split(X, y, test_size=0.33, random_state=42)

In [99]:
from sklearn.ensemble import RandomForestClassifier
rfc = RandomForestClassifier(n_estimators = 10).fit(X_train, y_train)
rfc.score(X_test, y_test)

0.9454545454545454

In [100]:
from sklearn.linear_model import LogisticRegression
model = LogisticRegression(max_iter=4000).fit(X_train, y_train)

In [101]:
model.score(X_test, y_test)

0.906060606060606

In [102]:
from sklearn.preprocessing import StandardScaler
scaler = StandardScaler().fit(X)
scaled_features = scaler.transform(X)

In [103]:
features = pd.DataFrame(scaled_features, columns=X.columns)

In [104]:
X_train, X_test, y_train, y_test = train_test_split(features, y, test_size=0.33, random_state=42)

In [105]:
from sklearn.neighbors import KNeighborsClassifier
fish_knc = KNeighborsClassifier(n_neighbors = 3).fit(X_train, y_train)
fish_knc.score(X_test, y_test)

0.9393939393939394

In [106]:
scores = []
for i in range(294):
    fish_knc = KNeighborsClassifier(n_neighbors = i+1).fit(X_train, y_train)
    scores.append(fish_knc.score(X_test, y_test))

In [107]:
max(scores)

0.9424242424242424